radex-workshop-2026/repos/rhapsody-plugins-openfoam/examples/openfoam-cases/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

profiling
{
    active      true;
}

functions
{
    #includeFunc streamlines
    avgInlets
    {
        type               surfaceFieldValue;
        functionObjectLibs (fieldFunctionObjects);
        fields             (p);
        operation          areaAverage;
        regionType         patch;
        name               inlet;
        writeFields        true;
        surfaceFormat      none;
    }

    radexWrite
    {
        type            radexWrite;
        libs            (radexWrite);
        executeControl  onEnd;
        writeControl    onEnd;
        errors          strict;

        // No volume fields exported by this block.
        fields          ();

        // Export scalar result of the avgInlets function object.
        scalars         (avgInlets);

        identifier      pitzDaily;
    }
}


// ************************************************************************* //
